app/controllers/songs_controller.rb

  def edit
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])

      # Artist not found. Redirect to artists path
      if artist.nil?
        redirect_to artists_path, alert: "Artist not found"

      # Artist found. Edit song or redirect to artist's songs path if song not found.
      else
        @song = artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]